const ExtraInfoComp: React.FC = () => {
  return (
    <div>
      <div className="w-full bg-slate-700 grid grid-cols-4 gap-y-3 gap-x-3 py-3 my-2 px-2 rounded-lg">
        <div className="w-full flex flex-col justify-end bg-slate-100 rounded-lg">
          <h2 className="font-semibold text-lg p-2">ساعت های اتوماتیک</h2>
          <p className="p-2 text-justify">
            ساعت‌های اتوماتیک و مکانیکی از مکانیسم‌های مشابهی برای ایجاد تنش در
            شاه فنر استفاده می‌کنند. این تنش در هنگام ر‌ها شدن فنر ساعت ایجاد
            می‌شود. برای یک ساعت مکانیکی، کوک شدن دستی تاج باعث ایجاد تنش در شاه
            فنر می‌شود. برای یک ساعت اتوماتیک، انرژی جنبشی تولید شده توسط حرکت
            عقربه‌ها باعث ایجاد تنش برای تأمین انرژی ساعت می‌شود. بیایید این
            مکانیسم را جزئی‌تر بررسی کنیم. هر ساعت اتوماتیک مجهز به روتوری است
            که به «قلب» ساعت متصل می‌شود. این روتور از فلزات قوی مانند طلا یا
            پلاتین به عنوان بلبرینگ یا وزنه استفاده می‌کند.
          </p>
        </div>
        <div className="w-full flex flex-col justify-end bg-slate-100 rounded-lg">
        <h2 className="font-semibold text-lg p-2">ساعت های اتوماتیک</h2>
          <p className="p-2 text-justify">
            ساعت‌های اتوماتیک و مکانیکی از مکانیسم‌های مشابهی برای ایجاد تنش در
            شاه فنر استفاده می‌کنند. این تنش در هنگام ر‌ها شدن فنر ساعت ایجاد
            می‌شود. برای یک ساعت مکانیکی، کوک شدن دستی تاج باعث ایجاد تنش در شاه
            فنر می‌شود. برای یک ساعت اتوماتیک، انرژی جنبشی تولید شده توسط حرکت
            عقربه‌ها باعث ایجاد تنش برای تأمین انرژی ساعت می‌شود. بیایید این
            مکانیسم را جزئی‌تر بررسی کنیم. هر ساعت اتوماتیک مجهز به روتوری است
            که به «قلب» ساعت متصل می‌شود. این روتور از فلزات قوی مانند طلا یا
            پلاتین به عنوان بلبرینگ یا وزنه استفاده می‌کند.
          </p>
        </div>
        <div className="w-full flex flex-col justify-end bg-slate-100 rounded-lg">
        <h2 className="font-semibold text-lg p-2">ساعت های اتوماتیک</h2>
          <p className="p-2 text-justify">
            ساعت‌های اتوماتیک و مکانیکی از مکانیسم‌های مشابهی برای ایجاد تنش در
            شاه فنر استفاده می‌کنند. این تنش در هنگام ر‌ها شدن فنر ساعت ایجاد
            می‌شود. برای یک ساعت مکانیکی، کوک شدن دستی تاج باعث ایجاد تنش در شاه
            فنر می‌شود. برای یک ساعت اتوماتیک، انرژی جنبشی تولید شده توسط حرکت
            عقربه‌ها باعث ایجاد تنش برای تأمین انرژی ساعت می‌شود. بیایید این
            مکانیسم را جزئی‌تر بررسی کنیم. هر ساعت اتوماتیک مجهز به روتوری است
            که به «قلب» ساعت متصل می‌شود. این روتور از فلزات قوی مانند طلا یا
            پلاتین به عنوان بلبرینگ یا وزنه استفاده می‌کند.
          </p>
        </div>
        <div className="w-full flex flex-col justify-end bg-slate-100 rounded-lg">
        <h2 className="font-semibold text-lg p-2">ساعت های اتوماتیک</h2>
          <p className="p-2 text-justify">
            ساعت‌های اتوماتیک و مکانیکی از مکانیسم‌های مشابهی برای ایجاد تنش در
            شاه فنر استفاده می‌کنند. این تنش در هنگام ر‌ها شدن فنر ساعت ایجاد
            می‌شود. برای یک ساعت مکانیکی، کوک شدن دستی تاج باعث ایجاد تنش در شاه
            فنر می‌شود. برای یک ساعت اتوماتیک، انرژی جنبشی تولید شده توسط حرکت
            عقربه‌ها باعث ایجاد تنش برای تأمین انرژی ساعت می‌شود. بیایید این
            مکانیسم را جزئی‌تر بررسی کنیم. هر ساعت اتوماتیک مجهز به روتوری است
            که به «قلب» ساعت متصل می‌شود. این روتور از فلزات قوی مانند طلا یا
            پلاتین به عنوان بلبرینگ یا وزنه استفاده می‌کند.
          </p>
        </div>
      </div>
    </div>
  );
};

export default ExtraInfoComp;
